БПКР/src/Catalogs/ОперацииБанкКасса/ОперацииБанкКасса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОперацииБанкКасса</name>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорСчет</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийППИ</types>
      <types>EnumRef.ВидыОперацийРКО</types>
      <types>EnumRef.ВидыОперацийППВ</types>
      <types>EnumRef.ВидыОперацийПКО</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПлатежа</name>
    <type>
      <types>CatalogRef.КодыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

БПКР/src/Catalogs/ОперацииБанкКасса/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ВидДокумента = "ППИ" Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийППИ"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
	ИначеЕсли Объект.ВидДокумента = "РКО" Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийРКО"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
	ИначеЕсли Объект.ВидДокумента = "ППВ" Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийППВ"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
	Иначе
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийПКО"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);	
	КонецЕсли;	
	
	Элементы.ВидОперации.ОграничениеТипа = ОписаниеТипов;	
	
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	
	Объект.ВидОперации = Неопределено;
	
	Если Объект.ВидДокумента = "ППИ" Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийППИ"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
	ИначеЕсли Объект.ВидДокумента = "РКО" Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийРКО"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
	ИначеЕсли Объект.ВидДокумента = "ППВ" Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийППВ"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
	Иначе
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийПКО"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);	
	КонецЕсли;	
	
	Элементы.ВидОперации.ОграничениеТипа = ОписаниеТипов;
	
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементов()
		
	Элементы.КодПлатежа.Видимость 			= Объект.ВидДокумента = "ППИ";
	Элементы.НазначениеПлатежа.Видимость 	= Объект.ВидДокумента = "ППИ";
	
КонецПроцедуры 

#КонецОбласти
